** foo
#+BEGIN_SRC cpp :results output
#include <stdio.h>
int main() {
  printf("sdf\n");
  int foo[10];
  foo[11] = 2;
  printf("z\n");
  return 0;
}
#+END_SRC

#+RESULTS:
: STDERR:
: *** stack smashing detected ***: terminated

** star 1
 - <2021-12-02 Thu 18:15>
#+BEGIN_SRC cpp :results output
#include <stdio.h>

int main() {
  FILE *f = fopen("01.txt", "r");
  int increases = 0;
  int prev = -1;
  int cur;
  while (1 == fscanf(f, "%d", &cur)) {
    if (prev != -1 && cur > prev)
      increases++;
    prev = cur;
  }
  printf("= %d\n", increases);
  return 0;
}
#+END_SRC

#+RESULTS:
: = 1167
 - <2021-12-02 Thu 18:17>

** star 2
#+BEGIN_SRC cpp :results output
#include <stdio.h>

int main() {
  FILE *f = fopen("01.txt", "r");
  int increases = 0;
  int prevprevprev = -1;
  int prevprev = -1;
  int prev = -1;
  int cur;
  while (1 == fscanf(f, "%d", &cur)) {
    if (prev != -1 && prevprev != -1 && prevprevprev != -1 && prevprev + prev + cur > prevprevprev + prevprev + prev)
      increases++;
    prevprevprev = prevprev;
    prevprev = prev;
    prev = cur;
  }
  printf("= %d\n", increases);
  return 0;
}
#+END_SRC

#+RESULTS:
: = 1130
 - <2021-12-02 Thu 18:21>
** star 1
  - <2021-12-02 Thu 18:23>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <stdlib.h>
int main() {
  FILE *f = fopen("02.txt", "r");
  int horpos = 0;
  int depth = 0;
  while (true) {
    int val;
    if (fscanf(f, "forward %d\n", &val) == 1) {
      horpos += val;
    } else if (fscanf(f, "down %d\n", &val) == 1) {
      depth += val;
    } else if (fscanf(f, "up %d\n", &val) == 1) {
      depth -= val;
    } else {
      break;
    }
  }

  printf("= %d\n", horpos * depth);
  return 0;
}
#+END_SRC

#+RESULTS:
: = 1989014
 - <2021-12-02 Thu 18:26>
** star 2
  - <2021-12-02 Thu 18:23>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <stdlib.h>
int main() {
  FILE *f = fopen("02.txt", "r");
  int horpos = 0;
  int depth = 0;
  int aim = 0;
  while (true) {
    int val;
    if (fscanf(f, "forward %d\n", &val) == 1) {
      horpos += val;
      depth += val * aim;
    } else if (fscanf(f, "down %d\n", &val) == 1) {
      aim += val;
    } else if (fscanf(f, "up %d\n", &val) == 1) {
      aim -= val;
    } else {
      break;
    }
  }

  printf("= %ld\n", (long)horpos * depth);
  return 0;
}
#+END_SRC

#+RESULTS:
: = 2006917119
 - <2021-12-02 Thu 18:28>

** part 1
#+BEGIN_SRC cpp :results output
#include <stdio.h>
int main() {
  char line[256];
  long gamma = 0;
  long epsilon = 0;
  for (int i = 0; i < 12; i++) {
    gamma = gamma << 1;
    epsilon = epsilon << 1;
    FILE *f = fopen("03.txt", "r");
    int ones = 0;
    int zeros = 0;
    while (fgets(line, sizeof(line), f)) {
      if (line[i] == '1') ones++; else zeros++;
    }
    if (ones > zeros) {
      gamma += 1;
    } else {
      epsilon += 1;
    }
  }
  printf("= %ld\n", gamma * epsilon);
  return 0;
}
#+END_SRC

#+RESULTS:
: = 3969000

 - 16159416000 too high <2021-12-03 Fri 18:26>
 - 3969000 correct <2021-12-03 Fri 18:28>
** part 2
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#define LEN 12
int main() {
  int numbers[1024];
  int numbersi = 0;
  char line[256];

  int oxygen = -1;

  {
  FILE *f = fopen("03.txt", "r");
  while (fgets(line, sizeof(line), f)) {
    int value = 0;
    for (int i = 0; line[i] == '0' || line[i] == '1'; i++) {
      value = value << 1;
      if (line[i] == '1') value += 1;
    }
    numbers[numbersi++] = value;
  }

  for (int i = LEN-1; i >= 0; i--) {
    int ones = 0, zeros = 0;
    for (int ni = 0; ni < numbersi; ni++) {
      if (numbers[ni] == -1) continue;
      if ((numbers[ni] & (1 << i)) >= 1) ones++; else zeros++;
      //printf("'%d' ones=%d, zeros=%d\n", numbers[ni], ones, zeros);
    }
    int found = -1;
    int founds = 0;
    for (int ni = 0; ni < numbersi; ni++) {
      if (numbers[ni] == -1) continue;
      if ((numbers[ni] & (1 << i)) >= 1 != (ones >= zeros) >= 1) numbers[ni] = -1;
      else { found = numbers[ni]; founds++; }
    }
    //printf("i=%d  ones=%d  zeros=%d  founds=%d\n", i, ones, zeros, founds);
    if (founds == 1) { oxygen = found; break; }
  }
  }
  

  int co2 = -1;
  numbersi = 0;
  {
  FILE *f = fopen("03.txt", "r");
  while (fgets(line, sizeof(line), f)) {
    int value = 0;
    for (int i = 0; line[i] == '0' || line[i] == '1'; i++) {
      value = value << 1;
      if (line[i] == '1') value += 1;
    }
    numbers[numbersi++] = value;
  }

  for (int i = LEN-1; i >= 0; i--) {
    int ones = 0, zeros = 0;
    for (int ni = 0; ni < numbersi; ni++) {
      if (numbers[ni] == -1) continue;
      if ((numbers[ni] & (1 << i)) >= 1) ones++; else zeros++;
      //printf("'%d' ones=%d, zeros=%d\n", numbers[ni], ones, zeros);
    }
    int found = -1;
    int founds = 0;
    for (int ni = 0; ni < numbersi; ni++) {
      if (numbers[ni] == -1) continue;
      if ((numbers[ni] & (1 << i)) >= 1 == (ones >= zeros) >= 1) numbers[ni] = -1;
      else { found = numbers[ni]; founds++; }
    }
    //printf("i=%d  ones=%d  zeros=%d  founds=%d\n", i, ones, zeros, founds);
    if (founds == 1) { co2 = found; break; }
  }
  }

  printf("o=%d  co2=%d\n", oxygen, co2);
  printf("= %ld\n", oxygen * co2);
  return 0;
}
#+END_SRC

#+RESULTS:
: o=2509  co2=1701
: = 4267809

 - 819540 too low <2021-12-03 Fri 18:48>
 - 4267809 correct <2021-12-03 Fri 18:58>
** part 1
 - <2021-12-04 Sat 11:29>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
int main() {
  int draws[1024];
  int drawsi = 0;

  char line[1024];
  FILE *f = fopen("04.txt", "r");
  {
    fgets(line, sizeof(line), f);
    line[strlen(line)-1] = 0;
    char *str1, *token, *saveptr;
    str1 = line;
    while (token = strtok_r(str1, ",", &saveptr)) {
      draws[drawsi++] = atoi(token);
      str1 = NULL;
    }
  }

  int boards[100][5][5];
  int boardsi = 0;

  while (fgets(line, sizeof(line), f)) {
    for (int i = 0; i < 5; i++) {
      fgets(line, sizeof(line), f);
      for (int j = 0; j < 5; j++) {
        boards[boardsi][i][j] = atoi(line + j*3);
      }
    }
    boardsi++;
  }
if (false) {
  for (int b = 0; b < boardsi; b++) {
    for (int i = 0; i < 5; i++) {
      for (int j = 0; j < 5; j++) {
        printf("%2d ", boards[b][i][j]);
      }
      printf("\n");
    }
    printf("\n");
  }
}

  for (int d = 0; d < drawsi; d++) {
    for (int b = 0; b < boardsi; b++) {
      for (int i = 0; i < 5; i++) {
        for (int j = 0; j < 5; j++) {
          if (boards[b][i][j] == draws[d]) {
            boards[b][i][j] = -1;
          }
        }
      }
    }
if (false) {
  printf("## draw %d\n", draws[d]);
  for (int b = 0; b < boardsi; b++) {
    for (int i = 0; i < 5; i++) {
      for (int j = 0; j < 5; j++) {
        printf("%2d ", boards[b][i][j]);
      }
      printf("\n");
    }
    printf("\n");
  }
}
    
    for (int b = 0; b < boardsi; b++) {
      int bingoboard = false;
      for (int i = 0; i < 5; i++) {
        int bingo = true;
        for (int j = 0; j < 5; j++) {
          if (boards[b][i][j] != -1) bingo = false;
        }
        if (bingo) bingoboard = true;
      }
      for (int j = 0; j < 5; j++) {
        int bingo = true;
        for (int i = 0; i < 5; i++) {
          if (boards[b][i][j] != -1) bingo = false;
        }
        if (bingo) bingoboard = true;
      }
      if (bingoboard) {
        int unmarkedsum = 0;
        for (int i = 0; i < 5; i++) {
          for (int j = 0; j < 5; j++) {
            if (boards[b][i][j] != -1) unmarkedsum += boards[b][i][j];
          }
        }
        printf("= %d\n", unmarkedsum*draws[d]);
        return 0;
      }
    }
  }
  return 0;
}
#+END_SRC

#+RESULTS:
: = 16716

 - 16716 correct <2021-12-04 Sat 12:01>
** part 2
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
int main() {
  int draws[1024];
  int drawsi = 0;

  char line[1024];
  FILE *f = fopen("04.txt", "r");
  {
    fgets(line, sizeof(line), f);
    line[strlen(line)-1] = 0;
    char *str1, *token, *saveptr;
    str1 = line;
    while (token = strtok_r(str1, ",", &saveptr)) {
      draws[drawsi++] = atoi(token);
      str1 = NULL;
    }
  }

  int boards[100][5][5];
  int boardsi = 0;

  while (fgets(line, sizeof(line), f)) {
    for (int i = 0; i < 5; i++) {
      fgets(line, sizeof(line), f);
      for (int j = 0; j < 5; j++) {
        boards[boardsi][i][j] = atoi(line + j*3);
      }
    }
    boardsi++;
  }
if (false) {
  for (int b = 0; b < boardsi; b++) {
    for (int i = 0; i < 5; i++) {
      for (int j = 0; j < 5; j++) {
        printf("%2d ", boards[b][i][j]);
      }
      printf("\n");
    }
    printf("\n");
  }
}

  int won[1024];
  for (int b = 0; b < boardsi; b++) {
    won[b] = false;
  }
  int wons = 0;

  for (int d = 0; d < drawsi; d++) {
    for (int b = 0; b < boardsi; b++) {
      for (int i = 0; i < 5; i++) {
        for (int j = 0; j < 5; j++) {
          if (boards[b][i][j] == draws[d]) {
            boards[b][i][j] = -1;
          }
        }
      }
    }
if (false) {
  printf("## draw %d\n", draws[d]);
  for (int b = 0; b < boardsi; b++) {
    for (int i = 0; i < 5; i++) {
      for (int j = 0; j < 5; j++) {
        printf("%2d ", boards[b][i][j]);
      }
      printf("\n");
    }
    printf("\n");
  }
}
    
    for (int b = 0; b < boardsi; b++) {
      if (won[b]) continue;
      int bingoboard = false;
      for (int i = 0; i < 5; i++) {
        int bingo = true;
        for (int j = 0; j < 5; j++) {
          if (boards[b][i][j] != -1) bingo = false;
        }
        if (bingo) bingoboard = true;
      }
      for (int j = 0; j < 5; j++) {
        int bingo = true;
        for (int i = 0; i < 5; i++) {
          if (boards[b][i][j] != -1) bingo = false;
        }
        if (bingo) bingoboard = true;
      }
      if (bingoboard) {
        won[b] = true;
        wons++;
        if (wons != boardsi) continue;
        int unmarkedsum = 0;
        for (int i = 0; i < 5; i++) {
          for (int j = 0; j < 5; j++) {
            if (boards[b][i][j] != -1) unmarkedsum += boards[b][i][j];
          }
        }
        printf("= %d\n", unmarkedsum*draws[d]);
        return 0;
      }
    }
  }
  return 0;
}
#+END_SRC

#+RESULTS:
: = 4880

- 4880 correct <2021-12-04 Sat 12:04>

** part 1
 - <2021-12-05 Sun 07:26>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#define MAX 1000
int main() {
  int grid[MAX][MAX] = { 0 };

  FILE *f = fopen("05.txt", "r");
  int x1, y1, x2, y2;
  int tmp;
  while (fscanf(f, "%d,%d -> %d,%d\n", &x1, &y1, &x2, &y2) == 4) {
    if (x1 == x2) {
      if (y1 > y2) { tmp = y1; y1 = y2; y2 = tmp; }
      for (int y = y1; y <= y2; y++)
        grid[y][x1]++;
    }
    if (y1 == y2) {
      if (x1 > x2) { tmp = x1; x1 = x2; x2 = tmp; }
      for (int x = x1; x <= x2; x++)
        grid[y1][x]++;
    }
  }

  int overlaps = 0;
  for (int y = 0; y < MAX; y++) 
    for (int x = 0; x < MAX; x++)
      if (grid[y][x] >= 2)
        overlaps++;

  if (false)
  for (int y = 0; y < MAX; y++) {
    for (int x = 0; x < MAX; x++) {
      printf("%c", grid[y][x] == 0 ? '.' : '0'+grid[y][x]);
    }
    printf("\n");
  }


  printf("= %d\n", overlaps);
  return 0;
}
#+END_SRC 

#+RESULTS:
: = 5145

 - 10140 too high <2021-12-05 Sun 07:34>
 - 9526 too high <2021-12-05 Sun 07:37>
 - 5145 correct <2021-12-05 Sun 07:38>
** part 2
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#define MAX 1000
int main() {
  int grid[MAX][MAX] = { 0 };

  FILE *f = fopen("05.txt", "r");
  int x1, y1, x2, y2;
  int tmp;
  while (fscanf(f, "%d,%d -> %d,%d\n", &x1, &y1, &x2, &y2) == 4) {
    int x = x1, y = y1;
      grid[y][x]++;
    do {
      if (x < x2) x++; else if (x > x2) x--;
      if (y < y2) y++; else if (y > y2) y--;
      grid[y][x]++;
    } while (x != x2 || y != y2);
    //printf("## %d,%d -> %d,%d\n", x1, y1, x2, y2);
  if (false)
  for (int y = 0; y < MAX; y++) {
    for (int x = 0; x < MAX; x++) {
      printf("%c", grid[y][x] == 0 ? '.' : '0'+grid[y][x]);
    }
    printf("\n");
  }
  }

  int overlaps = 0;
  for (int y = 0; y < MAX; y++) 
    for (int x = 0; x < MAX; x++)
      if (grid[y][x] >= 2)
        overlaps++;

  if (false)
  for (int y = 0; y < MAX; y++) {
    for (int x = 0; x < MAX; x++) {
      printf("%c", grid[y][x] == 0 ? '.' : '0'+grid[y][x]);
    }
    printf("\n");
  }


  printf("= %d\n", overlaps);
  return 0;
}
#+END_SRC 

#+RESULTS:
: = 16518

 - 7074 too low <2021-12-05 Sun 07:40>
 - 16518 correct <2021-12-05 Sun 07:48>
   
** part 1
 - <2021-12-06 Mon 17:07>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <string.h>
int main() {
  FILE *f = fopen("06.txt", "r");

  int dayToCount[9] = {0};
  char line[1024];
  fgets(line, sizeof(line), f);
  for (int i = 0; line[i]; i++) {
    if (line[i] >= '0' && line[i] <= '9')
      dayToCount[line[i]-'0']++;
  }

  for (int i = 0; i < 9; i++) {
    printf("%d=%d\n", i, dayToCount[i]);
  }
  printf("\n");

  for (int day = 0; day < 80; day++) {
    int zeros = dayToCount[0];
    for (int i = 0; i < 9; i++)
      dayToCount[i] = dayToCount[i+1];
    dayToCount[8] = zeros;
    dayToCount[6] += zeros;
  }

  int sum = 0;
  for (int i = 0; i < 9; i++) {
    printf("%d=%d\n", i, dayToCount[i]);
    sum += dayToCount[i];
  }

  printf("= %d\n", sum);
  return 0;
}
#+END_SRC

#+RESULTS:
#+begin_example
0=0
1=83
2=51
3=58
4=54
5=54
6=0
7=0
8=0

0=25532
1=42594
2=31998
3=47322
4=42341
5=47270
6=57495
7=23297
8=33243
= 351092
#+end_example

 - 595118 too high <2021-12-06 Mon 17:19>
 - 351092 correct <2021-12-06 Mon 17:22>
** part 2
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <string.h>
int main() {
  FILE *f = fopen("06.txt", "r");

  long dayToCount[9] = {0};
  char line[1024];
  fgets(line, sizeof(line), f);
  for (int i = 0; line[i]; i++) {
    if (line[i] >= '0' && line[i] <= '9')
      dayToCount[line[i]-'0']++;
  }

  for (int i = 0; i < 9; i++) {
    printf("%d=%ld\n", i, dayToCount[i]);
  }
  printf("\n");

  for (int day = 0; day < 256; day++) {
    long zeros = dayToCount[0];
    for (int i = 0; i < 9; i++)
      dayToCount[i] = dayToCount[i+1];
    dayToCount[8] = zeros;
    dayToCount[6] += zeros;
  }

  long sum = 0;
  for (int i = 0; i < 9; i++) {
    printf("%d=%ld\n", i, dayToCount[i]);
    sum += dayToCount[i];
  }

  printf("= %ld\n", sum);
  return 0;
}
#+END_SRC

#+RESULTS:
#+begin_example
0=0
1=83
2=51
3=58
4=54
5=54
6=0
7=0
8=0

0=140304164138
1=162039539115
2=170391060831
3=188187916968
4=208218433266
5=218720012046
6=252082120574
7=117783213814
8=137604155253
= 1595330616005
#+end_example

 - 1595330616005 correct <2021-12-06 Mon 17:24>
** part 1
 - <2021-12-07 Tue 17:31>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <stdlib.h>
int main() {
  int poss[1024];
  int possi = 0;
  FILE *f = fopen("07.txt", "r");
  char line[1024];
  int linei = 0, c;
  while ((c = fgetc(f)) != EOF) {
    if (c >= '0' && c <= '9') {
      line[linei++] = c;
    } else {
      if (linei >= 1) {
        line[linei] = 0;
        poss[possi++] = atoi(line);
      }
      linei = 0;
    }
  }
  int min = 99999, max = 0;
  for (int i = 0; i < possi; i++) {
    if (poss[i] < min) min = poss[i];
    if (poss[i] > max) max = poss[i];
  }
  int mincost = 9999999999;
  int mina = -1;
  for (int a = min; a <= max; a++) {
    int cost = 0;
    for (int i = 0; i < possi; i++) {
      cost += poss[i] > a ? poss[i] - a : a - poss[i];
    }
    if (cost < mincost || mina == -1) {
      mincost = cost;
      mina = a;
    }
  }

  printf("= %d\n", mincost);
  return 0;
}
#+END_SRC

#+RESULTS:
: = 337833

 - 331 too low <2021-12-07 Tue 17:44>
 - 337833 correct <2021-12-07 Tue 17:47>
** part 2
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <stdlib.h>
int main() {
  int poss[1024];
  int possi = 0;
  FILE *f = fopen("07.txt", "r");
  char line[1024];
  int linei = 0, c;
  while ((c = fgetc(f)) != EOF) {
    if (c >= '0' && c <= '9') {
      line[linei++] = c;
    } else {
      if (linei >= 1) {
        line[linei] = 0;
        poss[possi++] = atoi(line);
      }
      linei = 0;
    }
  }
  int min = 99999, max = 0;
  for (int i = 0; i < possi; i++) {
    if (poss[i] < min) min = poss[i];
    if (poss[i] > max) max = poss[i];
  }
  int mincost = 9999999999;
  int mina = -1;
  for (int a = min; a <= max; a++) {
    int cost = 0;
    for (int i = 0; i < possi; i++) {
      for (int j = 1; j <= (poss[i] > a ? poss[i] - a : a - poss[i]); j++)
        cost += j;
      //cost += poss[i] > a ? poss[i] - a : a - poss[i];
    }
    if (cost < mincost || mina == -1) {
      mincost = cost;
      mina = a;
    }
  }

  printf("= %d\n", mincost);
  return 0;
}
#+END_SRC

#+RESULTS:
: = 96678050

 - 96678050 correct <2021-12-07 Tue 17:49>
** part 1
 - <2021-12-08 Wed 17:04>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
int main() {
  FILE *f = fopen("08.txt", "r");
  char line[1024];
  int knowns = 0;
  while (fgets(line, sizeof(line), f)) {
    int i = 0;
    while (line[i] != '|') i++;
    int len = 0;
    while (line[i] != '\n') {
      i++;
      if (line[i] >= 'a' && line[i] <= 'z') {
        len++;
      } else {
        if (len == 2 || len == 4 || len == 3 || len == 7)
          knowns++;
        len = 0;
      }
    }
  }
  printf("%d\n", knowns);
  return 0;
}
#+END_SRC

#+RESULTS:
: 237


 - 75 wrong <2021-12-08 Wed 17:13>
 - 237 correct <2021-12-08 Wed 17:15>
** part 2
#+BEGIN_SRC cpp :results output
  #include <stdio.h>
  int main() {
    FILE *f = fopen("08.txt", "r");
    char line[1024];
    int knowns = 0;
    int sum = 0;
    while (fgets(line, sizeof(line), f)) {
      // 0=6, 1=2, 2=5, 3=5, 4=4, 5=5, 6=6, 7=3, 8=7, 9=6
      // 2=1
      // 3=7
      // 4=4
      // 5=2,3,5
      // 6=0,6,9
      // 7=8
      
      // acedgfb cdfbe gcdfa fbcad dab cefabd cdfgeb eafb cagedb ab
      // ab = 1 so ab -> cf
      // dab = 7 so abd -> acf so d -> a
      // eafb = 4 so eafb -> bcdf so ef -> bd
      // acedgfb = 8 so nothing
      // look for 0 (has len=6 and cf and one of bd)
      // look for 9 (has len=6 and cf and bd)
      // look for 6 (has len=6 and one of cf and bd)
      // look for 2 (has len=5 and one of cf and one of bd)
      // look for 3 (has len=5 and cf and one of bd)
      // look for 5 (has len=5 and one of cf and bd)

  //   0:  
  //  aaaa    0000
  // b    c  1    2 
  // b    c  1    2
  //  dddd    3333
  // e    f  4    5
  // e    f  4    5
  //  gggg    6666

      char bd[7] = { false };
      char cf[7] = { false };
      char val[7] = { false };
      int vallen = 0;
      for (int state = 0; state < 2; state++) {
      for (int i = 0; line[i] != '|'; i++) {
        if (line[i] >= 'a' && line[i] <= 'z') {
          val[line[i] - 'a'] = true;
          vallen++;
        } else {
          //printf("%d%d %d%d %d%d %d%d\n", val[0], val[1], val[2], val[3], val[4], val[5], val[6], val[7]);

          if (state == 0 && vallen == 2) { // 1
            for (int j = 0; j < 7; j++)
              cf[j] = val[j];
          }
          if (state == 1 && vallen == 4) { // 4
            for (int j = 0; j < 7; j++)
              bd[j] = val[j] && !cf[j];
          }
          for (int j = 0; j < 7; j++) val[j] = false;
          vallen = 0;
        }
      }
      }

      int result = 0;
      int state = 0;
      for (int i = 0; i == 0 || line[i-1] != '\n'; i++) {
        if (state == 0) {
          if (line[i] == '|') {
            state = 1;
            i++;
          }
          continue;
        }
        if (line[i] >= 'a' && line[i] <= 'z') {
          val[line[i] - 'a'] = true;
          vallen++;
        } else {
          //printf("%d%d %d%d %d%d %d\n", val[0], val[1], val[2], val[3], val[4], val[5], val[6]);

          result *= 10;

          int has_cfs = 0;
          int has_bds = 0;
          for (int j = 0; j < 7; j++) {
            if (val[j] && bd[j]) has_bds++;
            if (val[j] && cf[j]) has_cfs++;
          }

          if (vallen == 6 && has_cfs == 2 && has_bds == 1)
            result += 0;
          else if (vallen == 2)
            result += 1;
          else if (vallen == 5 && has_cfs == 1 && has_bds == 1)
            result += 2;
          else if (vallen == 5 && has_cfs == 2 && has_bds == 1)
            result += 3;
          else if (vallen == 4)
            result += 4;
          else if (vallen == 5 && has_cfs == 1 && has_bds == 2)
            result += 5;
          else if (vallen == 6 && has_cfs == 1 && has_bds == 2)
            result += 6;
          else if (vallen == 3)
            result += 7;
          else if (vallen == 7)
            result += 8;
          else if (vallen == 6 && has_cfs == 2 && has_bds == 2)
            result += 9;
          else
            printf("## !\n");

          for (int j = 0; j < 7; j++) val[j] = false;
          vallen = 0;
        }
      }
      //printf("## %d\n", result);
      sum += result;
    }
    printf("%d\n", sum);
    return 0;
  }
#+END_SRC

#+RESULTS:
: 1009098

 - 1009098 correct <2021-12-08 Wed 18:27>
** part 1
 - <2021-12-09 Thu 17:40>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <string.h>
int main() {
  FILE *f = fopen("09.txt", "r");
  char grid[110][110];
  int gridx = 0;
  int gridy = 0;
  char line[1024];
  while (fgets(line, sizeof(line), f)) {
    for (int i = 0; line[i] != '\n'; i++) {
      grid[gridy][i] = line[i] - '0';
      gridx = i + 1;
    }
    gridy++;
  }

  if (false) {
  printf("## %dx%d\n", gridy, gridx);
  for (int i = 0; i < gridy; i++) {
    for (int j = 0; j < gridx; j++) {
      printf("%d", grid[i][j]);
    }
    printf("\n");
  }
  }

  int sum = 0;
  for (int i = 0; i < gridy; i++) {
    for (int j = 0; j < gridx; j++) {
      int islow = true;
      if (i > 0 && grid[i-1][j] <= grid[i][j]) islow = false;
      if (i < gridy-1 && grid[i+1][j] <= grid[i][j]) islow = false;
      if (j > 0 && grid[i][j-1] <= grid[i][j]) islow = false;
      if (j < gridx-1 && grid[i][j+1] <= grid[i][j]) islow = false;
      if (islow) {
        sum += 1 + grid[i][j];
        if (false) {
        printf("## %d,%d = %d,", i, j, grid[i][j]);
        if (i > 0) printf(" 1=%d", grid[i-1][j]);
        if (i < gridy-1) printf(" 2=%d", grid[i+1][j]);
        if (j > 0) printf(" 3=%d", grid[i][j-1]);
        if (j < gridx-1) printf(" 4=%d", grid[i][j+1]);
        printf("\n");
        }
      }
    }  
  }

  printf("%d\n", sum);
  return 0;
}
#+END_SRC

#+RESULTS:
: 465

 - 1815 too high <2021-12-09 Thu 17:51>
 - 465 correct <2021-12-09 Thu 18:01>
** part 2
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <string.h>
int main() {
  FILE *f = fopen("09.txt", "r");
  char grid[110][110];
  int gridx = 0;
  int gridy = 0;
  char line[1024];
  while (fgets(line, sizeof(line), f)) {
    for (int i = 0; line[i] != '\n'; i++) {
      grid[gridy][i] = line[i] - '0';
      gridx = i + 1;
    }
    gridy++;
  }

  if (false) {
  printf("## %dx%d\n", gridy, gridx);
  for (int i = 0; i < gridy; i++) {
    for (int j = 0; j < gridx; j++) {
      printf("%d", grid[i][j]);
    }
    printf("\n");
  }
  }

  int basin1 = 0, basin2 = 0, basin3 = 0;

  char q[10000];
  int qi = 0;
  char mark[110][110] = {false};
  for (int i = 0; i < gridy; i++) {
    for (int j = 0; j < gridx; j++) {
      if (grid[i][j] == 9) continue;
      if (mark[i][j]) continue;

      int size = 0;
      q[qi++] = i;
      q[qi++] = j;
      while (qi != 0) {
        int ci = q[qi-2];
        int cj = q[qi-1];
        qi -= 2;
        if (mark[ci][cj]) continue;
        mark[ci][cj] = true;
        if (grid[ci][cj] == 9) continue;
        size++;

        if (ci > 0 && !mark[ci-1][cj] && grid[ci-1][cj] != 9) { q[qi++] = ci-1; q[qi++] = cj; }
        if (ci < gridy-1 && !mark[ci+1][cj] && grid[ci+1][cj] != 9) { q[qi++] = ci+1; q[qi++] = cj; }
        if (cj > 0 && !mark[ci][cj-1] && grid[ci][cj-1] != 9) { q[qi++] = ci; q[qi++] = cj-1; }
        if (cj < gridx-1 && !mark[ci][cj+1] && grid[ci][cj+1] != 9) { q[qi++] = ci; q[qi++] = cj+1; }
        if (qi > sizeof(q)) { printf("qi big\n"); return 0; }
      }

      if (size > basin1) {
        basin3 = basin2;
        basin2 = basin1;
        basin1 = size;
      } else if (size > basin2) {
        basin3 = basin2;
        basin2 = size;
      } else if (size > basin3) {
        basin3 = size;
      }
    }
  }

  printf("%d\n", basin1 * basin2 * basin3);
  return 0;
}
#+END_SRC

#+RESULTS:
: 1269555

 - 1269555 correct <2021-12-09 Thu 18:41>
** part 1
 - <2021-12-10 Fri 17:23>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
int main() {
  FILE *f = fopen("10.txt", "r");
  char line[1024];

  int score = 0;
  while (fgets(line, sizeof(line), f)) {
    char s[1024];
    int si = 0;
    for (int i = 0; line[i] != '\n'; i++) {
      if (line[i] == '(' || line[i] == '[' || line[i] == '{' || line[i] == '<') {
        s[si++] = line[i];
      } else {
        if (si == 0) goto end;
        if (line[i] == ')') {
          if (s[--si] != '(') { score += 3; goto end; }
        } else if (line[i] == ']') {
          if (s[--si] != '[') { score += 57; goto end; }
        } else if (line[i] == '}') {
          if (s[--si] != '{') { score += 1197; goto end; }
        } else if (line[i] == '>') {
          if (s[--si] != '<') { score += 25137; goto end; }
        } else { printf("! %c\n", line[i]); return 0; }
      }
    }
    end:
    ;
  }
  printf("%d\n", score);
  return 0;
}
#+END_SRC

#+RESULTS:
: 806111462

 - 367059 correct <2021-12-10 Fri 17:39>
** part 2
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <stdlib.h>

int cmpint(const void *p1, const void *p2) {
  long a = *(long*)p1;
  long b = *(long*)p2;
  return a < b ? -1 : a > b ? 1 : 0;
}

int main() {
  FILE *f = fopen("10.txt", "r");
  char line[1024];

  long scores[1024];
  int scoresi = 0;

  while (fgets(line, sizeof(line), f)) {
    char s[1024];
    int si = 0;
    int invalid = false;
    for (int i = 0; line[i] != '\n'; i++) {
      if (line[i] == '(' || line[i] == '[' || line[i] == '{' || line[i] == '<') {
        s[si++] = line[i];
      } else {
        if (si == 0) goto end;
        if (line[i] == ')') {
          if (s[--si] != '(') { invalid = true; goto end; }
        } else if (line[i] == ']') {
          if (s[--si] != '[') { invalid = true; goto end; }
        } else if (line[i] == '}') {
          if (s[--si] != '{') { invalid = true; goto end; }
        } else if (line[i] == '>') {
          if (s[--si] != '<') { invalid = true; goto end; }
        } else { printf("! %c\n", line[i]); return 0; }
      }
    }
    end:
    ;

    if (!invalid) {
      long score = 0;
      while (si > 0) {
        si--;
        score *= 5;
        if (s[si] == '(') score += 1;
        else if (s[si] == '[') score += 2;
        else if (s[si] == '{') score += 3;
        else if (s[si] == '<') score += 4;
      }
      scores[scoresi++] = score;
    }
  }

  qsort(scores, scoresi, sizeof(long), cmpint);

  printf("%ld\n", scores[scoresi/2]);
  return 0;
}
#+END_SRC

#+RESULTS:
: 1952146692

 - 598669714 too low <2021-12-10 Fri 18:05>
 - 1952146692 correct <2021-12-10 Fri 18:08>
** part 1
 - <2021-12-11 Sat 15:28>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
int main() {
  FILE *f = fopen("11.txt", "r");

  char grid[11][11];
  char line[1024];
  for (int i = 0; i < 10; i++) {
    fgets(line, sizeof(line), f);
    for (int j = 0; j < 10; j++) {
      grid[i][j] = line[j]-'0';
    }
  }

  if (false) {
  for (int i = 0; i < 10; i++) {
    for (int j = 0; j < 10; j++) {
      printf("%d", grid[i][j]);
    }
    printf("\n");
  }
  }

  int flashes = 0;
  for (int step = 0; step < 100; step++) {
    for (int i = 0; i < 10; i++)
      for (int j = 0; j < 10; j++)
        grid[i][j]++;

    int didflash = true;
    while (didflash) {
    didflash = false;
    for (int i = 0; i < 10; i++) {
      for (int j = 0; j < 10; j++) {
        if (grid[i][j] >= 10) {
          flashes++;
          didflash = true;
          grid[i][j] = -1000000;
        for (int di = -1; di <= 1; di++) {
          for (int dj = -1; dj <= 1; dj++) {
            if (i+di >= 0 && i+di < 10 && j+dj >= 0 && j+dj < 10) {
              grid[i+di][j+dj]++;
            }
          }
        }
        }
      }
    }
    }
       
    for (int i = 0; i < 10; i++)
      for (int j = 0; j < 10; j++)
        if (grid[i][j] < 0) grid[i][j] = 0;

  if (false) {
  printf("## after %d steps\n", step+1);
  for (int i = 0; i < 10; i++) {
    for (int j = 0; j < 10; j++) {
      printf("%d", grid[i][j]);
    }
    printf("\n");
  }
  }
  }
  

  printf("%d\n", flashes);
  return 0;
}
#+END_SRC

#+RESULTS:
: 1691

 - 1691 correct <2021-12-11 Sat 15:44>
** part 2
#+BEGIN_SRC cpp :results output
#include <stdio.h>
int main() {
  FILE *f = fopen("11.txt", "r");

  char grid[11][11];
  char line[1024];
  for (int i = 0; i < 10; i++) {
    fgets(line, sizeof(line), f);
    for (int j = 0; j < 10; j++) {
      grid[i][j] = line[j]-'0';
    }
  }

  if (false) {
  for (int i = 0; i < 10; i++) {
    for (int j = 0; j < 10; j++) {
      printf("%d", grid[i][j]);
    }
    printf("\n");
  }
  }

  for (int step = 0; step < 300; step++) {
    int flashes = 0;
    for (int i = 0; i < 10; i++)
      for (int j = 0; j < 10; j++)
        grid[i][j]++;

    int didflash = true;
    while (didflash) {
    didflash = false;
    for (int i = 0; i < 10; i++) {
      for (int j = 0; j < 10; j++) {
        if (grid[i][j] >= 10) {
          flashes++;
          didflash = true;
          grid[i][j] = -1000000;
        for (int di = -1; di <= 1; di++) {
          for (int dj = -1; dj <= 1; dj++) {
            if (i+di >= 0 && i+di < 10 && j+dj >= 0 && j+dj < 10) {
              grid[i+di][j+dj]++;
            }
          }
        }
        }
      }
    }
    }
       
    for (int i = 0; i < 10; i++)
      for (int j = 0; j < 10; j++)
        if (grid[i][j] < 0) grid[i][j] = 0;

  if (false) {
  printf("## after %d steps\n", step+1);
  for (int i = 0; i < 10; i++) {
    for (int j = 0; j < 10; j++) {
      printf("%d", grid[i][j]);
    }
    printf("\n");
  }
  }
    if (flashes == 10*10) {
      printf("%d\n", step+1);
      break;
    }
  }
  printf("?\n");
  
  return 0;
}
#+END_SRC

#+RESULTS:
: 216
: ?

 - 216 correct <2021-12-11 Sat 15:48>
** part 1
 - <2021-12-12 Sun 09:11>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <string.h>
#include <stdarg.h>
#define LEN 30

char cave[LEN][LEN] = {false};
char cavenames[LEN][10];
int cavenamesi = 0;
char cavebig[LEN] = {false};
char visited[LEN] = {false};
char path[1024];
int pathi;
int indent = 0;
char bigsvisited[LEN] = {false};

  void p(const char *fmt, ...) {
  return;
    va_list ap;
    va_start(ap, fmt);
    for (int i = 0; i < indent; i++)
      printf(" ");
    vprintf(fmt, ap);
    va_end(ap);
  }


int routes(int cur) {
  indent++;
  p("> %d=%s\n", cur, cavenames[cur]);
  if (strcmp(cavenames[cur], "end") == 0) {
    for (int i = 0; i < cavenamesi; i++) 
      bigsvisited[i] = false;
    for (int i = 0; i < pathi; i++) {
      bigsvisited[path[i]] = true;
    }
    for (int i = 0; i < cavenamesi; i++) {
      //if (cavebig[i] && !bigsvisited[i]) {indent--;return 0;}
    }
    p("< found route!\n");
    if (false) {
    for (int i = 0; i < pathi; i++) printf("%d=%s,", path[i], cavenames[path[i]]);
    printf("\n");
    }

    indent--;
    return 1;
  }
  int out = 0;
  for (int i = 0; i < cavenamesi; i++) {
    //p("? -> %d=%s con=%d, big=%d, visited=%d\n", i, cavenames[i], cave[cur][i], cavebig[i], visited[i]);
    if (cave[cur][i] && (cavebig[i] || !visited[i])) {
      path[pathi++] = i;
      visited[i] = true;
      out += routes(i);
      visited[i] = false;
      pathi--;
    }
  }
  p("< %d=%s\n", cur, cavenames[cur]);
  indent--;
  return out;
}

int main() {
  FILE *f = fopen("12.txt", "r");
  char line[1024];
  while (fgets(line, sizeof(line), f)) {
    line[strlen(line)-1] = 0;
    char *from = line;
    char *to = line;
    while (to[0] != '-') to++;
    to[0] = 0;
    to++;

    int fromi = -1;
    int toi = -1;
    for (int i = 0; i < cavenamesi; i++) {
      if (strcmp(cavenames[i], from) == 0) fromi = i;
      if (strcmp(cavenames[i], to) == 0) toi = i;
    }
    if (fromi == -1) { fromi = cavenamesi; strcpy(cavenames[cavenamesi++], from); }
    if (toi == -1) { toi = cavenamesi; strcpy(cavenames[cavenamesi++], to); }
    cave[fromi][toi] = true;
    cave[toi][fromi] = true;
    cavebig[fromi] = from[0] >= 'A' && from[0] <= 'Z';
    cavebig[toi] = to[0] >= 'A' && to[0] <= 'Z';
  }

  if (false) {
  for (int i = 0; i < cavenamesi; i++) {
    printf("## %d=%s -> ", i, cavenames[i]);
    for (int j = 0; j < cavenamesi; j++) {
      if (cave[i][j]) printf("%d=%s, ", j, cavenames[j]);
    }
    printf("\n");
  }
  }

  for (int i = 0; i < cavenamesi; i++)
    if (strcmp(cavenames[i], "start") == 0) {
      visited[i] = true;
      printf("%d\n", routes(i));
      break;
    }
  return 0;
}
#+END_SRC

#+RESULTS:
: 4659

 - 4659 correct <2021-12-12 Sun 09:53>
** part 2
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <string.h>
#include <stdarg.h>
#define LEN 30

char cave[LEN][LEN] = {false};
char cavenames[LEN][10];
int cavenamesi = 0;
char cavebig[LEN] = {false};
char visited[LEN] = {0};
char path[1024];
int pathi;
int indent = 0;
char bigsvisited[LEN] = {false};

  void p(const char *fmt, ...) {
  return;
    va_list ap;
    va_start(ap, fmt);
    for (int i = 0; i < indent; i++)
      printf(" ");
    vprintf(fmt, ap);
    va_end(ap);
  }


int routes(int cur) {
  indent++;
  p("> %d=%s\n", cur, cavenames[cur]);
  if (strcmp(cavenames[cur], "start") == 0 && visited[cur] > 1) {
    return 0;
  }
  if (strcmp(cavenames[cur], "end") == 0) {
    for (int i = 0; i < cavenamesi; i++) 
      bigsvisited[i] = false;
    for (int i = 0; i < pathi; i++) {
      bigsvisited[path[i]] = true;
    }
    int singlesmallvisitedtwice = false;
    for (int i = 0; i < cavenamesi; i++) {
      if (!cavebig[i] && visited[i] == 2) {
        if (singlesmallvisitedtwice) {indent--;return 0;}
        singlesmallvisitedtwice = true;
      }
      
      //if (cavebig[i] && !bigsvisited[i]) {indent--;return 0;}
    }
    p("< found route!\n");
    if (false) {
    for (int i = 0; i < pathi; i++) printf("%s,", cavenames[path[i]]);
    printf("\n");
    }

    indent--;
    return 1;
  }
  int out = 0;
  for (int i = 0; i < cavenamesi; i++) {
    //p("? -> %d=%s con=%d, big=%d, visited=%d\n", i, cavenames[i], cave[cur][i], cavebig[i], visited[i]);
    if (cave[cur][i] && (cavebig[i] || visited[i] < 2)) {
      path[pathi++] = i;
      visited[i]++;
      out += routes(i);
      visited[i]--;
      pathi--;
    }
  }
  p("< %d=%s\n", cur, cavenames[cur]);
  indent--;
  return out;
}

int main() {
  FILE *f = fopen("12.txt", "r");
  char line[1024];
  while (fgets(line, sizeof(line), f)) {
    line[strlen(line)-1] = 0;
    char *from = line;
    char *to = line;
    while (to[0] != '-') to++;
    to[0] = 0;
    to++;

    int fromi = -1;
    int toi = -1;
    for (int i = 0; i < cavenamesi; i++) {
      if (strcmp(cavenames[i], from) == 0) fromi = i;
      if (strcmp(cavenames[i], to) == 0) toi = i;
    }
    if (fromi == -1) { fromi = cavenamesi; strcpy(cavenames[cavenamesi++], from); }
    if (toi == -1) { toi = cavenamesi; strcpy(cavenames[cavenamesi++], to); }
    cave[fromi][toi] = true;
    cave[toi][fromi] = true;
    cavebig[fromi] = from[0] >= 'A' && from[0] <= 'Z';
    cavebig[toi] = to[0] >= 'A' && to[0] <= 'Z';
  }

  if (false) {
  for (int i = 0; i < cavenamesi; i++) {
    printf("## %d=%s -> ", i, cavenames[i]);
    for (int j = 0; j < cavenamesi; j++) {
      if (cave[i][j]) printf("%d=%s, ", j, cavenames[j]);
    }
    printf("\n");
  }
  }

  for (int i = 0; i < cavenamesi; i++)
    if (strcmp(cavenames[i], "start") == 0) {
      visited[i] = true;
      printf("%d\n", routes(i));
      break;
    }
  return 0;
}
#+END_SRC

#+RESULTS:
: 148962

 - 148962 correct <2021-12-12 Sun 10:01>
** part 1
 - <2021-12-13 Mon 18:06>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <string.h>
#define LEN 1500
int main() {
  char xys[LEN][LEN] = {false};
  FILE *f = fopen("13.txt", "r");
  char line[1024];
  int minx = 0, miny = 0, maxx = 0, maxy = 0;
  while (fgets(line, sizeof(line), f)) {
    if (line[0] == '\n') break;
    int x,y;
    sscanf(line, "%d,%d", &x, &y);
    xys[x][y] = true;
    if (x > maxx) maxx = x;
    if (y > maxy) maxy = y;
  }

  while (fgets(line, sizeof(line), f)) {
    if (false) {
    //printf("## %d,%d\n", maxx, maxy);
    for (int y = miny; y <= maxy; y++) {
     for (int x = minx; x <= maxx; x++) {
         printf("%c", xys[x][y] ? '#' : '.');
      }
      printf("\n");
    }
    }

    if (strncmp(line, "fold along y=", sizeof("fold along y=")-1) == 0) {
      int fold;
      sscanf(line, "fold along y=%d", &fold);
      for (int i = 1; ; i++) {
        int y1 = fold-i;
        int y2 = fold+i;
        if (y1 < miny || y2 > maxy) break;
        for (int x = minx; x <= maxx; x++) {
          if (xys[x][y2]) xys[x][y1] = true;
        }
      }
      maxy = fold-1;
    } else {
      int fold;
      sscanf(line, "fold along x=%d", &fold);
      for (int i = 1; ; i++) {
        int x1 = fold-i;
        int x2 = fold+i;
        if (x1 < minx || x2 > maxx) break;
        for (int y = miny; y <= maxy; y++) {
          if (xys[x2][y]) xys[x1][y] = true;
        }
      }
      maxx = fold-1;
    }

    break;
  }

  if (false) {
    printf("## %d,%d\n", maxx, maxy);
    for (int y = miny; y <= maxy; y++) {
     for (int x = minx; x <= maxx; x++) {
         printf("%c", xys[x][y] ? '#' : '.');
      }
      printf("\n");
    }
  }

  int dots = 0;
  for (int y = miny; y <= maxy; y++)
    for (int x = minx; x <= maxx; x++)
      if (xys[x][y]) dots++;
  

  printf("%d\n", dots);
  return 0;
}
#+END_SRC

#+RESULTS:
: 661

 - 661 correct <2021-12-13 Mon 18:23>
** part 2
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <string.h>
#define LEN 1500
int main() {
  char xys[LEN][LEN] = {false};
  FILE *f = fopen("13.txt", "r");
  char line[1024];
  int minx = 0, miny = 0, maxx = 0, maxy = 0;
  while (fgets(line, sizeof(line), f)) {
    if (line[0] == '\n') break;
    int x,y;
    sscanf(line, "%d,%d", &x, &y);
    xys[x][y] = true;
    if (x > maxx) maxx = x;
    if (y > maxy) maxy = y;
  }

  while (fgets(line, sizeof(line), f)) {
    if (false) {
    //printf("## %d,%d\n", maxx, maxy);
    for (int y = miny; y <= maxy; y++) {
     for (int x = minx; x <= maxx; x++) {
         printf("%c", xys[x][y] ? '#' : '.');
      }
      printf("\n");
    }
    }

    if (strncmp(line, "fold along y=", sizeof("fold along y=")-1) == 0) {
      int fold;
      sscanf(line, "fold along y=%d", &fold);
      for (int i = 1; ; i++) {
        int y1 = fold-i;
        int y2 = fold+i;
        if (y1 < miny || y2 > maxy) break;
        for (int x = minx; x <= maxx; x++) {
          if (xys[x][y2]) xys[x][y1] = true;
        }
      }
      maxy = fold-1;
    } else {
      int fold;
      sscanf(line, "fold along x=%d", &fold);
      for (int i = 1; ; i++) {
        int x1 = fold-i;
        int x2 = fold+i;
        if (x1 < minx || x2 > maxx) break;
        for (int y = miny; y <= maxy; y++) {
          if (xys[x2][y]) xys[x1][y] = true;
        }
      }
      maxx = fold-1;
    }
  }

  if (true) {
    printf("## %d,%d\n", maxx, maxy);
    for (int y = miny; y <= maxy; y++) {
     for (int x = minx; x <= maxx; x++) {
         printf("%c", xys[x][y] ? '#' : '.');
      }
      printf("\n");
    }
  }

  int dots = 0;
  for (int y = miny; y <= maxy; y++)
    for (int x = minx; x <= maxx; x++)
      if (xys[x][y]) dots++;
  

  printf("%d\n", dots);
  return 0;
}
#+END_SRC

#+RESULTS:
: ## 39,5
: ###..####.#..#.#....#..#..##..####.###..
: #..#.#....#.#..#....#.#..#..#.#....#..#.
: #..#.###..##...#....##...#....###..#..#.
: ###..#....#.#..#....#.#..#....#....###..
: #....#....#.#..#....#.#..#..#.#....#....
: #....#....#..#.####.#..#..##..#....#....
: 89

 - PFKLKCFP correct <2021-12-13 Mon 18:24>
** part 1
 - <2021-12-14 Tue 17:39>
#+BEGIN_SRC cpp :results output
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
int main() {
  FILE *f = fopen("14.txt", "r");
  char pairs[133][133] = {0};
  char line[1024];

  char *tmp1 = (char*)malloc(100000);
  char *tmp2 = (char*)malloc(100000);

  fgets(line, sizeof(line), f);
  line[strlen(line)-1] = 0;
  strcpy(tmp1, line);
  while (fgets(line, sizeof(line), f)) {
    if (line[0] == '\n') continue;
    pairs[line[0]][line[1]] = line[6];
  }

  char *prev = tmp1;
  //printf("## %d = %s\n", 0, tmp1);
  for (int step = 0; step < 20; step++) {
    char *cur = (step % 2) ? tmp2 : tmp1;
    char *next = (step % 2) ? tmp1 : tmp2;

    int nexti = 0;
    next[nexti++] = cur[0];
    for (int i = 1; cur[i]; i++) {
      next[nexti++] = pairs[cur[i-1]][cur[i]];
      next[nexti++] = cur[i];
    }
    next[nexti++] = 0;
    //printf("## %d = %s\n", step+1, next);
    prev = next;
  }

  int counts[133] = {0};
  for (int i = 0; prev[i]; i++) {
    counts[prev[i]]++;
  }

  int max = 0;
  int min = 9999999999;
  for (int i = 'A'; i <= 'Z'; i++) {
    if (counts[i] > 0 && counts[i] < min) min = counts[i];
    if (counts[i] > max) max = counts[i];
  }

  printf("%d\n", max - min);
  return 0;
}
#+END_SRC

#+RESULTS:
: 3411

 - 3411 correct <2021-12-14 Tue 17:56>
** part 2
#+BEGIN_SRC cpp :results output
    #include <stdio.h>
    #include <stdlib.h>
    #include <string.h>
    char pairs[133][133] = {0};
    long pairToCharToCounts[26][26][26] = {0};
    char paircached[26][26] = {false};

    char *tmp1 = (char*)malloc(100000000);
    char *tmp2 = (char*)malloc(100000000);
    char *prev = tmp1;

    long** charcountstmp1() {
      prev = tmp1;
      for (int step = 0; step < 20; step++) {
        char *cur = (step % 2) ? tmp2 : tmp1;
        char *next = (step % 2) ? tmp1 : tmp2;

        int nexti = 0;
        next[nexti++] = cur[0];
        for (int i = 1; cur[i]; i++) {
          next[nexti++] = pairs[cur[i-1]][cur[i]];
          next[nexti++] = cur[i];
        }
        next[nexti++] = 0;
        prev = next;
      }
    }

    void charcounts(char a, char b) {
      if (paircached[a-'A'][b-'A']) return;
      tmp1[0] = a;
      tmp1[1] = b;
      tmp1[2] = 0;

      charcountstmp1();

      for (int i = 0; prev[i]; i++) {
        pairToCharToCounts[a-'A'][b-'A'][prev[i]-'A']++;
      }
      paircached[a-'A'][b-'A'] = true;
    }

    int main() {
      FILE *f = fopen("14.txt", "r");
      char line[1024];

      fgets(line, sizeof(line), f);
      line[strlen(line)-1] = 0;
      strcpy(tmp1, line);
      while (fgets(line, sizeof(line), f)) {
        if (line[0] == '\n') continue;
        pairs[line[0]][line[1]] = line[6];
      }

      charcountstmp1();

      char *mid = strdup(prev);

      //printf("## midlen=%d %c%c\n", strlen(mid), mid[0], mid[1]);
      //long pairToCharToCounts[25][25][25] = {0};
      long counts[133] = {0};
      for (int i = 1; mid[i]; i++) {
        charcounts(mid[i-1], mid[i]);
        //printf("%c%c: ", mid[i-1], mid[i]);
        for (int j = 0; j < 25; j++) {
          //printf("%c=%ld ", 'A'+j, pairToCharToCounts[mid[i-1]-'A'][mid[i]-'A'][j]);
          counts['A'+j] += pairToCharToCounts[mid[i-1]-'A'][mid[i]-'A'][j];
        }
        if (mid[i+1]) counts[mid[i]]--;
        //printf("\n");
        //break;
      }

      long max = 0;
      long min = -1;
      for (int i = 'A'; i <= 'Z'; i++) {
        if (counts[i] == 0) continue;
        printf("## %c=%ld\n", i, counts[i]);
        if (counts[i] > 0 && (min < 0 || counts[i] < min)) min = counts[i];
        if (counts[i] > max) max = counts[i];
      }

      printf("%ld\n", max - min);

      return 0;
    }
#+END_SRC

#+RESULTS:
#+begin_example
## B=930680129376
## C=302338065046
## F=7780153820616
## H=1742505016267
## K=913725470018
## N=1566218246458
## O=967975612284
## P=4760683893900
## S=1358636927079
## V=567803746701
7477815755570
#+end_example

 - 7477815755570 correct <2021-12-14 Tue 19:22>
